In [1]:
print("hello")

hello

# Analyse simple sur la stat-desc
---

### Importation des packages

In [2]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import plotly.express as px
import seaborn as sns

Matplotlib is building the font cache; this may take a moment.

### Data importation

In [6]:
try:
    df = pd.read_excel('data.xlsx')
except:
    print('erreur :')
    %pip install openpyxl

### Basic manipulation

In [9]:
df.head()

   annee     mois   rec_douane      rec_connexe
0   2018  janvier  46951137555   19.549.999.674
1   2018  février  47313934748    5.248.767.786
2   2018     mars  50398861182    6.547.525.686
3   2018    avril  58775911887    7.220.072.918
4   2018      mai  58775911887    6.938.560.710

### Data manipulation
---

In [11]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 60 entries, 0 to 59
Data columns (total 4 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   annee        60 non-null     int64
 1   mois         60 non-null     object
 2   rec_douane   48 non-null     object
 3   rec_connexe  60 non-null     object
dtypes: int64(1), object(3)
memory usage: 2.0+ KB

In [13]:
print(df.isnull().sum())

annee           0
mois            0
rec_douane     12
rec_connexe     0
dtype: int64

In [15]:
df_copy = df.copy()

In [16]:
df_copy.head()

   annee     mois   rec_douane      rec_connexe
0   2018  janvier  46951137555   19.549.999.674
1   2018  février  47313934748    5.248.767.786
2   2018     mars  50398861182    6.547.525.686
3   2018    avril  58775911887    7.220.072.918
4   2018      mai  58775911887    6.938.560.710

In [23]:
df_copy.rec_douane.unique()

array([46951137555, 47313934748, 50398861182, 58775911887, 68656726875,
       67199882580, 91744270326, 81660584134, 86950027364, 77933324364,
       77055520300, 79921904201, 80077845319, 92707936942, 83347546877,
       90188111899, 82674828124, 86585709871, 74503183149, 71673553416,
       72467971836, 67422443268, 64175523691, '605 672 967 11',
       '674 329 875 42', '598 034 911 26', '572 341 506 44',
       '508 469 326 05', '547 063 519 15', '683 389 565 01',
       '868 370 554 60', '886 483 694 70', '766 505 408 72',
       '721 957 331 65', '636 420 776 89', '660 550 884 82',
       '717 241 756 94', '757 398 038 44', '796 947 998 13',
       '924 727 438 60', '976 677 455 15', '971 394 666 03', 220499157780,
       '127 1200 116 74', 118926586673, 122463353583, 127929318831, nan],
      dtype=object)

In [113]:
df_copy.rec_connexe.unique()

array(['19.549.999.674', '  5.248.767.786', '  6.547.525.686',
       '  7.220.072.918', '  6.938.560.710', '10.087.033.209',
       '13.747.618.364', '18.154.441.800', '22.319.200.107',
       '18.872.341.724', '17.499.907.474', '20.518.021.342',
       '20.456.591.937', '16.382.282.808', '20.163.096.373',
       '22.212.658.797', '19.504.046.902', '16.797.307.841',
       '18.382.897.338', '28.529.563.557', '25.723.259.339',
       '27.152.511.693', '23.529.903.715', '24.667.260.047',
       '17.818.736.907', '17.921.237.425', '18.428.901.188',
       '14.310.096.310', '14.515.819.753', '17.726.283.703',
       '18.939.079.682', '18.318.468.473', '17.534.840.664',
       '19.586.626.410', '15.957.368.731', '17.014.737.376',
       '23.049.066.917', '16.036.148.675', '17.654.667.381',
       '18.520.275.640', '18.661.258.606', '33.011.803.549',
       '22.590.445.106', '23.409.205.473', '21.840.804.138',
       '23.273.983.165', '23.917.713.477', '20,720,485,819',
       '21,390,075,497', '27,574,121,734', '26,861,850,903',
       '34,393,431,285', '36,360,766,011', '40,254,144,158',
       '46,817,361,628', '45,234,266,283', '42,991,169,158',
       '41,916,221,297', '47,684,200,972'], dtype=object)

#### Suppression des vides dans une chaine

In [187]:
def remove_empty_str(v):
    k = str(v).strip()

    if ' ' in k:
        l = k.split(' ')
        
        # On supprime les valeurs vide de la liste
        for i in range(len(l)-1, -1, -1):
            if l[i] == "":
                del l[i]
        
        if len(l)==1:
            return int(l[0])
        else:
            concatenation = ''.join(str(element) for element in l) # On fait la concaténation des entiers converti en str
            
            if '.' in concatenation:
                concatenation = ''.join(str(element) for element in concatenation)
                return int(concatenation)
            return int(concatenation)
        
    elif '.' in k:
        l = k.split('.')
        concatenation = ''.join(str(element) for element in l)
        return int(concatenation)
    
    elif ',' in k:
        l = k.split(',')
        concatenation = ''.join(str(element) for element in l)
        return int(concatenation)
    
    return int(k)

#### Converti un objet en un int

In [188]:
def converte_to_number(entry):
    try:
        if (type(entry) == int) | (type(entry) == float):
            return int(entry)
        elif type(entry) == str:
            try:
                return int(entry)
            except:
                if('.' in entry):
                    return entry
                return remove_empty_str(entry)
    except:
        return entry

In [189]:
remove_empty_str('717,24175,694 ')

71724175694

In [111]:
converte_to_number('717 241 756 94')

71724175694

In [112]:
print(converte_to_number('717 241 756 94.1'))

717 241 756 94.1

In [132]:
# Applying converte_to_number function to df_copy
df_copy.rec_douane = df_copy.rec_douane.apply(converte_to_number)

In [131]:
df_copy.head()

   annee     mois    rec_douane      rec_connexe
0   2018  janvier  4.695114e+10   19.549.999.674
1   2018  février  4.731393e+10    5.248.767.786
2   2018     mars  5.039886e+10    6.547.525.686
3   2018    avril  5.877591e+10    7.220.072.918
4   2018      mai  5.877591e+10    6.938.560.710

In [135]:
df_copy.rec_connexe.unique()

array(['19.549.999.674', '  5.248.767.786', '  6.547.525.686',
       '  7.220.072.918', '  6.938.560.710', '10.087.033.209',
       '13.747.618.364', '18.154.441.800', '22.319.200.107',
       '18.872.341.724', '17.499.907.474', '20.518.021.342',
       '20.456.591.937', '16.382.282.808', '20.163.096.373',
       '22.212.658.797', '19.504.046.902', '16.797.307.841',
       '18.382.897.338', '28.529.563.557', '25.723.259.339',
       '27.152.511.693', '23.529.903.715', '24.667.260.047',
       '17.818.736.907', '17.921.237.425', '18.428.901.188',
       '14.310.096.310', '14.515.819.753', '17.726.283.703',
       '18.939.079.682', '18.318.468.473', '17.534.840.664',
       '19.586.626.410', '15.957.368.731', '17.014.737.376',
       '23.049.066.917', '16.036.148.675', '17.654.667.381',
       '18.520.275.640', '18.661.258.606', '33.011.803.549',
       '22.590.445.106', '23.409.205.473', '21.840.804.138',
       '23.273.983.165', '23.917.713.477', '20,720,485,819',
       '21,390,075,497', '27,574,121,734', '26,861,850,903',
       '34,393,431,285', '36,360,766,011', '40,254,144,158',
       '46,817,361,628', '45,234,266,283', '42,991,169,158',
       '41,916,221,297', '47,684,200,972'], dtype=object)

In [144]:
remove_empty_str('5.248.767.786')

5248767786